#!/usr/bin/python
# -*- coding:utf-8 -*-

import math


if __name__ == "__main__":
    learning_rate = 0.01
    for a in range(1,100):
        cur = 0
        for i in range(1000):
            cur -= learning_rate*(cur**2 - a)
        print(' %d的平方根(近似)为：%.8f，真实值是：%.8f' % (a, cur, math.sqrt(a)))
"""
 1的平方根(近似)为：1.00000000，真实值是：1.00000000
 2的平方根(近似)为：1.41421356，真实值是：1.41421356
 3的平方根(近似)为：1.73205081，真实值是：1.73205081
 4的平方根(近似)为：2.00000000，真实值是：2.00000000
 5的平方根(近似)为：2.23606798，真实值是：2.23606798
 6的平方根(近似)为：2.44948974，真实值是：2.44948974
 7的平方根(近似)为：2.64575131，真实值是：2.64575131
 8的平方根(近似)为：2.82842712，真实值是：2.82842712
 9的平方根(近似)为：3.00000000，真实值是：3.00000000
 10的平方根(近似)为：3.16227766，真实值是：3.16227766
 11的平方根(近似)为：3.31662479，真实值是：3.31662479
 12的平方根(近似)为：3.46410162，真实值是：3.46410162
 13的平方根(近似)为：3.60555128，真实值是：3.60555128
 14的平方根(近似)为：3.74165739，真实值是：3.74165739
 15的平方根(近似)为：3.87298335，真实值是：3.87298335
 16的平方根(近似)为：4.00000000，真实值是：4.00000000
 17的平方根(近似)为：4.12310563，真实值是：4.12310563
 18的平方根(近似)为：4.24264069，真实值是：4.24264069
 19的平方根(近似)为：4.35889894，真实值是：4.35889894


"""